<a href="https://colab.research.google.com/github/nv-hiep/pyspark/blob/main/pyspark_course_GL_plays_counts_kmeans_clustering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import os

# innstall java
!apt-get install openjdk-8-jdk-headless -qq > /dev/null

# install spark (change the version number if needed)
if not os.path.exists('/content/spark-3.1.1-bin-hadoop3.2.tgz'):
  !wget -q http://archive.apache.org/dist/spark/spark-3.1.1/spark-3.1.1-bin-hadoop3.2.tgz
  
  # unzip the spark file to the current folder
  !tar xf spark-3.1.1-bin-hadoop3.2.tgz

# set your spark folder to your system path environment. 
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-3.1.1-bin-hadoop3.2"


# install findspark using pip
!pip install -q findspark

In [2]:
# For python users, you should also install pyspark using the following command.
# !pip install pyspark

Run a local spark session to test your installation:

In [3]:
import findspark
findspark.init()

from pyspark import SparkContext
from pyspark.sql import SparkSession, Window, Row

from pyspark.sql.functions import *
from pyspark.sql.types import *
import matplotlib.pyplot as plt

#https://spark.apache.org/docs/latest/sql-getting-started.html
# spark = SparkSession.builder.master("local[*]").getOrCreate()
spark = SparkSession.builder.appName('PySpark').getOrCreate()
# spark = SparkSession.builder.appName('PySpark').enableHiveSupport().getOrCreate()

spark.conf.set('spark.sql.repl.eagerEval.enabled', True) # Property used to format output tables better


# spark = SparkSession.builder.appName('PySpark').master("local[1]").config("spark.sql.catalogImplementation","hive").enableHiveSupport().getOrCreate()
# spark.conf.set("spark.sql.catalogImplementation","hive")
# spark.conf.set('spark.sql.sources.default', 'delta')
# spark.conf.set('spark.sql.legacy.createHiveTableByDefault', False)
# spark.conf.set('spspark.sql.hive.convertCTAS', True)

spark

In [4]:
import numpy as np
import pandas as pd
from scipy.sparse import csr_matrix
from sklearn.cluster import KMeans

# display results to 3 decimal points, not in scientific notation
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [5]:
# from pyspark.sql.functions import udf
# from pyspark.sql.types import IntegerType
import urllib.request

In [6]:
# ! rm -rf spark-3.1.1-bin-hadoop3.2.tgz

In [7]:
!ls

data	     lastfm.zip   spark-3.1.1-bin-hadoop3.2
kaggle.json  sample_data  spark-3.1.1-bin-hadoop3.2.tgz

In [8]:
from pyspark.ml.classification import LogisticRegression

# Connect to Kaggle

Ref: https://galhever.medium.com/how-to-import-data-from-kaggle-to-google-colab-8160caa11e2

Install the Kaggle package that will be used for importing the data.

In [9]:
!pip install kaggle

Requirement already satisfied: kaggle in /usr/local/lib/python3.7/dist-packages (1.5.12)
Requirement already satisfied: certifi in /usr/local/lib/python3.7/dist-packages (from kaggle) (2021.5.30)
Requirement already satisfied: python-slugify in /usr/local/lib/python3.7/dist-packages (from kaggle) (5.0.2)
Requirement already satisfied: requests in /usr/local/lib/python3.7/dist-packages (from kaggle) (2.23.0)
Requirement already satisfied: urllib3 in /usr/local/lib/python3.7/dist-packages (from kaggle) (1.24.3)
Requirement already satisfied: six>=1.10 in /usr/local/lib/python3.7/dist-packages (from kaggle) (1.15.0)
Requirement already satisfied: python-dateutil in /usr/local/lib/python3.7/dist-packages (from kaggle) (2.8.1)
Requirement already satisfied: tqdm in /usr/local/lib/python3.7/dist-packages (from kaggle) (4.41.1)
Requirement already satisfied: text-unidecode>=1.3 in /usr/local/lib/python3.7/dist-packages (from python-slugify->kaggle) (1.3)
Requirement already satisfied: idna<3,>=2.5 in /usr/local/lib/python3.7/dist-packages (from requests->kaggle) (2.10)
Requirement already satisfied: chardet<4,>=3.0.2 in /usr/local/lib/python3.7/dist-packages (from requests->kaggle) (3.0.4)

Next, we need to upload the credentials of our Kaggle account. To do so, you need to enter your profile and “Create New API Token”. If you already have one you can click on “Expire API Token” and create a new one.

Then, save the json file with your credentials on your computer and upload this file to Colab using the code below:

In [10]:
from google.colab import files

if not os.path.exists('/content/kaggle.json'):
  files.upload()

The Kaggle API client expects the json file to be in ~/.kaggle folder so let’s create a new folder and move it inside.

In [11]:
!mkdir -p ~/.kaggle
!cp kaggle.json ~/.kaggle/
!chmod 600 ~/.kaggle/kaggle.json

Next, we will click on the three vertical points on the right side of the screen and “Copy the API Command” of the dataset that we want to import from Kaggle.

In [12]:
# !kaggle datasets download -d jessicali9530/celeba-dataset
# !kaggle datasets download -d hesh97/titanicdataset-traincsv
! kaggle datasets download -d neferfufi/lastfm

lastfm.zip: Skipping, found more recently modified local copy (use --force to force download)

In [13]:
!pwd

/content

Let’s see the imported files:

In [14]:
!ls

data	     lastfm.zip   spark-3.1.1-bin-hadoop3.2
kaggle.json  sample_data  spark-3.1.1-bin-hadoop3.2.tgz

Now, the last step is to open the extracted files and get the data:

In [15]:
import zipfile
zip_ref = zipfile.ZipFile('lastfm.zip', 'r')
zip_ref.extractall('data')
zip_ref.close()

In [16]:
!ls

data	     lastfm.zip   spark-3.1.1-bin-hadoop3.2
kaggle.json  sample_data  spark-3.1.1-bin-hadoop3.2.tgz

In [17]:
# ! rm -rf titanicdataset-traincsv.zip

In [18]:
# !ls

In [19]:
% cd data

/content/data

In [20]:
!ls

userid-profile.csv				  usersha1-profile.csv
userid-timestamp-artid-artname-traid-traname.tsv  usersha1-profile.tsv
usersha1-artmbid-artname-plays.tsv

That’s it! Now your data is ready and you can start working on it.

# Read userid_profile data

In [99]:
DATA_PATH = '/content/'
DATA_DIR  = os.path.join(DATA_PATH, 'data')

In [100]:
if not os.path.exists(DATA_DIR):
  os.mkdir(DATA_DIR)

In [101]:
# url = 'https://storage.googleapis.com/kaggle-data-sets/50119/92017/compressed/userid-timestamp-artid-artname-traid-traname.tsv.zip?X-Goog-Algorithm=GOOG4-RSA-SHA256&X-Goog-Credential=gcp-kaggle-com%40kaggle-161607.iam.gserviceaccount.com%2F20210724%2Fauto%2Fstorage%2Fgoog4_request&X-Goog-Date=20210724T145658Z&X-Goog-Expires=259199&X-Goog-SignedHeaders=host&X-Goog-Signature=95a835e0400112e6132be28d12009dec126eab889e0c98f15c46ed9ff843d435150e8006991a7cf518a97bb49bfd110d6c732fb6bbb42156221abd376a466cea004e79dfdb16aeef9d0049442e221a6ff07d9580aa2aa0e1281e0cea1f81c2584d9b654da5d2eb59fa04eb78dd94b0d7f1c93c851efdeec15765a54269b45a99cd09546bcb18b6f9e7d0924e273637ff7d729a715b0b1f774862ced30b9f16ddefdb326af90f4b997f1bc600a3c4442080885a546e26252a8bea6d1f057be19476a60bf1651499ca524fcd3a5bc8180b7fe828fa91680d7907a45a2c9cef38c00d4a602a6524986a1978546bd2ea30af22eaa562aa818e5868ae552599d8888c'
# datfile = os.path.join( DATA_DIR, os.path.split(url)[-1])

# if not os.path.exists(datfile):
#   filename, headers = urllib.request.urlretrieve(url, datfile)

In [102]:
! ls

userid-profile.csv				  usersha1-profile.csv
userid-timestamp-artid-artname-traid-traname.tsv  usersha1-profile.tsv
usersha1-artmbid-artname-plays.tsv

In [103]:
data_file = os.path.join( DATA_DIR, 'usersha1-artmbid-artname-plays.tsv' )
plays_data = pd.read_csv( data_file, sep='\t', header=None )
plays_data.head()

                                          0  ...     3
0  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  2137
1  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  1099
2  00000c289a1829a808ac09c00daf10bc3c4e223b  ...   897
3  00000c289a1829a808ac09c00daf10bc3c4e223b  ...   717
4  00000c289a1829a808ac09c00daf10bc3c4e223b  ...   706

[5 rows x 4 columns]

In [104]:
plays_data.shape

(17535655, 4)

In [105]:
plays_data.columns

Int64Index([0, 1, 2, 3], dtype='int64')

In [106]:
plays_data.columns = ['user_id', 'artist_id', 'artist_name', 'plays']

In [107]:
plays_data.head(2)

                                    user_id  ... plays
0  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  2137
1  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  1099

[2 rows x 4 columns]

In [108]:
plays_data.describe()

             plays
count 17535655.000
mean       215.193
std        614.481
min          0.000
25%         35.000
50%         94.000
75%        224.000
max     419157.000

In [109]:
plays_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17535655 entries, 0 to 17535654
Data columns (total 4 columns):
 #   Column       Dtype
---  ------       -----
 0   user_id      object
 1   artist_id    object
 2   artist_name  object
 3   plays        int64
dtypes: int64(1), object(3)
memory usage: 535.1+ MB

In [110]:
# Check null values
plays_data.isnull().sum(axis = 0)

user_id             0
artist_id      226137
artist_name       204
plays               0
dtype: int64

In [111]:
plays_data.user_id.value_counts()

2040b3d3cb47caace19e728090a88d6b1087aa8e    166
13c0df8a58cd3ca9e37d8e90662d2ad3c062eaa5    166
52bf0682648b44e6cc27ebe512dd4fa3455a11c2    150
7679da839e1a6c2d299c7fd6834fb9bf6e229224    139
8d8643cded0ac18e66a3c5a2b74de21fbca0e6b7    132
                                           ...
1a297e272910f70edafe15fa83e0c9813201c3d8      1
598fd2a22494be25b3bbb5413fe2d525018ef4a3      1
0b4688de02bb80f602914deae0b65eac1f311fe0      1
d1dbe807d0e47036ca5308d0fec0e8d2df7f4fd2      1
fdb8cd010228f711cecc2ed0430795af2d07a907      1
Name: user_id, Length: 358868, dtype: int64

In [112]:
plays_data.user_id.nunique()

358868

In [113]:
plays_data.artist_name.nunique()

292363

# Artist data

In [114]:
artist_data = plays_data[ ['artist_id', 'plays'] ]
artist_data.head(2)

                              artist_id  plays
0  3bd73256-3905-4f3a-97e2-8b341527f805   2137
1  f2fb0ff0-5679-42ec-a55c-15109ce6e320   1099

In [115]:
artist_aggr = artist_data.groupby( by='artist_id', as_index=False ).sum()
artist_aggr.head(2)

                              artist_id  plays
0  00010eb3-ebfe-4965-81ef-0ac64cd49fde    517
1  0001cd84-2a11-4699-8d6b-0abf969c5f06   4991

In [116]:
artist_data.shape

(17535655, 2)

In [117]:
artist_aggr.shape

(160112, 2)

In [118]:
artist_aggr.columns

Index(['artist_id', 'plays'], dtype='object')

# Artist Data - Clustering

In [119]:
kmeans1 = KMeans(n_clusters=10)

In [120]:
kmeans1

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=10, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=None, tol=0.0001, verbose=0)

In [121]:
artist_counts = artist_aggr[ ['plays'] ]
artist_counts.head(2)

   plays
0    517
1   4991

In [122]:
artist_counts.to_numpy().shape

(160112, 1)

In [123]:
kmeans1.fit( artist_counts )

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=10, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=None, tol=0.0001, verbose=0)

In [124]:
# Sum of squared distances of samples to their closest cluster center.
kmeans1.inertia_

198418684748975.25

In [125]:
kmeans1.labels_.shape

(160112,)

In [126]:
# Add new column to artist_aggr
artist_aggr['cluster_id'] = kmeans1.labels_
artist_aggr.head(2)

                              artist_id  plays  cluster_id
0  00010eb3-ebfe-4965-81ef-0ac64cd49fde    517           0
1  0001cd84-2a11-4699-8d6b-0abf969c5f06   4991           0

# User Data (how many times songs played by a user)

In [127]:
user_data = plays_data[ ['user_id', 'plays'] ]
user_data.head(2)

                                    user_id  plays
0  00000c289a1829a808ac09c00daf10bc3c4e223b   2137
1  00000c289a1829a808ac09c00daf10bc3c4e223b   1099

In [128]:
user_aggr = user_data.groupby(by='user_id', as_index=False).sum()

In [129]:
user_aggr.head(2)

                                    user_id   plays
0  00000c289a1829a808ac09c00daf10bc3c4e223b   16716
1  00001411dc427966b17297bf4d69e7e193135d89  119921

In [130]:
user_aggr.shape

(358868, 2)

In [131]:
user_data.shape

(17535655, 2)

# Clustering on User data (similar users)

In [132]:
plays_counts = user_aggr[ ['plays'] ]
plays_counts.head(2)

    plays
0   16716
1  119921

In [133]:
kmeans2 = KMeans(n_clusters=10)

In [134]:
kmeans2.fit( plays_counts )

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=10, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=None, tol=0.0001, verbose=0)

In [135]:
# Add new col to user_aggr
user_aggr['cluster_id'] = kmeans2.labels_
user_aggr.head(2)

                                    user_id   plays  cluster_id
0  00000c289a1829a808ac09c00daf10bc3c4e223b   16716           5
1  00001411dc427966b17297bf4d69e7e193135d89  119921           1

In [136]:
user_aggr[user_aggr['cluster_id']==3]

                                         user_id  plays  cluster_id
134     001649ea2c073ccbf2fb29e297009413cd7fa9c8  41744           3
138     0016eb9d99dfafe22564d990cc5676f6edd463ba  54635           3
157     001a11b6b9a82c4bec0b1e1e472067a8d14feab7  46496           3
232     0028ee93676310a78387c6cfad928ce8f3ea50a2  42485           3
269     002f4a28dc0be2098878e14d2928601c87bf3552  48319           3
...                                          ...    ...         ...
358586  ffc875a82adc6faf325883381ed639c5bcee754d  52429           3
358639  ffd35cdbf88331cc69abc33ca100cbeea6228733  44571           3
358673  ffd984144150653c085d0f7b32999800dccaff3d  43238           3
358734  ffe728d3f6e7ea7b3f4c89803d62c7ff51a24cf3  39556           3
358794  fff296f402ecb66864563e55fd669195981db86f  41540           3

[8252 rows x 3 columns]

In [137]:
del user_aggr
del kmeans2
del user_data
del artist_aggr
del kmeans1

# User Profile Data

In [138]:
! ls

userid-profile.csv				  usersha1-profile.csv
userid-timestamp-artid-artname-traid-traname.tsv  usersha1-profile.tsv
usersha1-artmbid-artname-plays.tsv

In [139]:
data_file = os.path.join( DATA_DIR, 'usersha1-profile.tsv' )
user_profile = pd.read_csv( data_file, sep='\t', header=None)

In [140]:
user_profile.head(2)

                                          0  1      2        3            4
0  00000c289a1829a808ac09c00daf10bc3c4e223b  f 22.000  Germany  Feb 1, 2007
1  00001411dc427966b17297bf4d69e7e193135d89  f    nan   Canada  Dec 4, 2007

In [141]:
user_profile.columns = ['user_id', 'gender', 'age', 'country', 'registered']

In [142]:
user_profile.head(2)

                                    user_id gender    age  country   registered
0  00000c289a1829a808ac09c00daf10bc3c4e223b      f 22.000  Germany  Feb 1, 2007
1  00001411dc427966b17297bf4d69e7e193135d89      f    nan   Canada  Dec 4, 2007

In [143]:
user_profile.shape

(359347, 5)

In [144]:
user_profile.describe()

             age
count 284447.000
mean      25.098
std       21.666
min    -1337.000
25%       20.000
50%       23.000
75%       28.000
max     1002.000

In [145]:
user_profile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359347 entries, 0 to 359346
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   user_id     359347 non-null  object
 1   gender      326572 non-null  object
 2   age         284447 non-null  float64
 3   country     359347 non-null  object
 4   registered  359347 non-null  object
dtypes: float64(1), object(4)
memory usage: 13.7+ MB

In [146]:
user_profile.isnull().sum()

user_id           0
gender        32775
age           74900
country           0
registered        0
dtype: int64

# Gender

In [147]:
user_profile.gender.value_counts()

m    241642
f     84930
Name: gender, dtype: int64

In [148]:
user_profile.gender.isnull().sum()

32775

# Age

In [149]:
user_profile.age.value_counts()

21.000      24054
20.000      24037
19.000      22261
22.000      22177
23.000      19890
            ...
84.000          5
85.000          4
121.000         2
1002.000        1
666.000         1
Name: age, Length: 113, dtype: int64

In [150]:
user_profile.age.isnull().sum()

74900

In [151]:
user_profile.age.describe()

count   284447.000
mean        25.098
std         21.666
min      -1337.000
25%         20.000
50%         23.000
75%         28.000
max       1002.000
Name: age, dtype: float64

# User country

In [152]:
user_profile.country.describe()

count            359347
unique              239
top       United States
freq              67044
Name: country, dtype: object

In [153]:
user_profile.country.value_counts()

United States         67044
Germany               31651
United Kingdom        29902
Poland                20987
Russian Federation    19833
                      ...
Marshall Islands          4
Benin                     3
Liberia                   3
Palau                     3
Gambia                    3
Name: country, Length: 239, dtype: int64

In [154]:
user_profile.country.unique()

array(['Germany', 'Canada', 'Mexico', 'United States', 'United Kingdom',
       'Finland', 'Poland', 'Spain', 'Ukraine', 'Sweden', 'Japan',
       'Australia', 'Portugal', 'Russian Federation', 'Belgium',
       'Guatemala', 'Netherlands', 'Bulgaria', 'Italy', 'Austria',
       'Korea, Republic of', 'Brazil', 'South Africa', 'Czech Republic',
       'Greece', 'Iran, Islamic Republic of', 'Chile', 'Thailand',
       'Norway', 'Slovakia', 'Taiwan', 'Turkey', 'Cyprus', 'France',
       'El Salvador', 'Belarus', 'Switzerland', 'Estonia', 'Uruguay',
       'Lithuania', 'Ireland', 'Croatia', 'Argentina', 'Lebanon',
       'Denmark', 'India', 'Nepal', 'Slovenia', 'Romania', 'Hungary',
       'Antarctica', 'Serbia', 'Singapore', 'Ghana',
       'Virgin Islands, U.s.', 'Syrian Arab Republic', 'China', 'Gabon',
       'Andorra', 'Israel', 'New Zealand', 'Iceland', 'Latvia', 'Peru',
       'Bosnia and Herzegovina', 'Georgia', 'Philippines', 'Colombia',
       'Malta', 'Fiji', 'Uganda', 'Northern Mariana Islands',
       'Azerbaijan', 'Micronesia, Federated States of', 'Saudi Arabia',
       'Viet Nam', 'Hong Kong', 'Venezuela', 'Togo',
       'Tanzania, United Republic of', 'Dominican Republic', 'Moldova',
       'Honduras', 'Albania', 'Indonesia', 'Papua New Guinea', 'Malaysia',
       'United Arab Emirates', 'Turkmenistan',
       'South Georgia and the South Sandwich Islands',
       'Heard Island and Mcdonald Islands', 'Puerto Rico', 'Ecuador',
       'Zimbabwe', 'Seychelles', 'Macedonia', 'Kazakhstan', 'Nicaragua',
       'Panama', 'Egypt', 'New Caledonia', 'Algeria', 'Djibouti',
       'Tunisia', 'Niue', 'Cook Islands',
       "Korea, Democratic People's Republic of", 'Luxembourg',
       'Wallis and Futuna', 'Afghanistan', 'Costa Rica', 'Greenland',
       'Sri Lanka', 'Bangladesh', 'Pitcairn',
       'British Indian Ocean Territory', 'Virgin Islands, British',
       'French Southern Territories',
       'United States Minor Outlying Islands',
       'Holy See (Vatican City State)', 'Pakistan',
       'Falkland Islands (Malvinas)', 'Paraguay', 'Qatar', 'Guadeloupe',
       'Libyan Arab Jamahiriya', 'Montenegro', 'Bolivia',
       "Lao People's Democratic Republic", 'Nauru', 'Barbados',
       'Christmas Island', 'Reunion', 'Antigua and Barbuda',
       'Cocos (Keeling) Islands', 'Burkina Faso', 'Dominica', 'Jamaica',
       'Congo, the Democratic Republic of the', 'Somalia', 'Chad',
       'Cambodia', 'San Marino', 'Palestinian Territory, Occupied',
       'Kiribati', 'Madagascar', 'Trinidad and Tobago', 'Bahamas',
       'Equatorial Guinea', 'Haiti', 'Tokelau', 'Oman', 'Armenia',
       'Gibraltar', 'Macao', 'Jordan', 'Norfolk Island', 'Western Sahara',
       'Mauritania', 'Zambia', 'Uzbekistan', 'Ethiopia',
       'Saint Vincent and the Grenadines', 'Svalbard and Jan Mayen',
       'Angola', 'Cuba', 'Aruba', "Cote D'Ivoire", 'Brunei Darussalam',
       'Sudan', 'Tonga', 'Lesotho', 'Faroe Islands', 'Mozambique',
       'Saint Helena', 'Guam', 'Guinea-Bissau', 'Morocco', 'Mauritius',
       'Cameroon', 'Swaziland', 'Kenya', 'Monaco', 'Bermuda',
       'Montserrat', 'American Samoa', 'Botswana', 'Comoros', 'Kuwait',
       'Tuvalu', 'Saint Kitts and Nevis', 'Turks and Caicos Islands',
       'Sao Tome and Principe', 'Bouvet Island', 'Cayman Islands',
       'Netherlands Antilles', 'French Guiana', 'Nigeria',
       'Liechtenstein', 'Martinique', 'Samoa', 'Anguilla', 'Bhutan',
       'Benin', 'Bahrain', 'Saint Lucia', 'Myanmar', 'Vanuatu',
       'Cape Verde', 'Eritrea', 'Senegal', 'Kyrgyzstan', 'Sierra Leone',
       'Tajikistan', 'Mongolia', 'French Polynesia', 'Solomon Islands',
       'Guyana', 'Gambia', 'Grenada', 'Mali', 'Yemen', 'Timor-Leste',
       'Maldives', 'Mayotte', 'Saint Pierre and Miquelon', 'Malawi',
       'Rwanda', 'Burundi', 'Belize', 'Suriname', 'Namibia', 'Niger',
       'Marshall Islands', 'Palau', 'Iraq', 'Liberia',
       'Central African Republic', 'Congo'], dtype=object)

In [155]:
'Australia' in user_profile.country.unique()

True

In [156]:
user_profile[ user_profile.country == 'Australia' ].head(2)

                                     user_id gender  ...    country    registered
14  000215d3060a5b0ab7b3c415d49ec579100d4c87      f  ...  Australia  Jul 26, 2008
18  00029d80b8af94f2d5e3349ceb28b7304f80c1c4    NaN  ...  Australia  Mar 27, 2005

[2 rows x 5 columns]

# User registration

In [157]:
user_profile.registered.describe()

count           359347
unique            2298
top       Jan 24, 2008
freq               569
Name: registered, dtype: object

In [158]:
user_profile.registered.value_counts()

Jan 24, 2008    569
Oct 28, 2008    502
Nov 2, 2008     490
Nov 9, 2008     471
Nov 3, 2008     468
               ...
Dec 28, 2002      1
Feb 10, 2004      1
Nov 10, 2009      1
Jun 17, 2003      1
Oct 27, 2003      1
Name: registered, Length: 2298, dtype: int64

# Merge datasets

In [159]:
plays_data.head(2)

                                    user_id  ... plays
0  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  2137
1  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  1099

[2 rows x 4 columns]

In [160]:
user_profile.head(2)

                                    user_id gender    age  country   registered
0  00000c289a1829a808ac09c00daf10bc3c4e223b      f 22.000  Germany  Feb 1, 2007
1  00001411dc427966b17297bf4d69e7e193135d89      f    nan   Canada  Dec 4, 2007

In [161]:
merged_data = plays_data.merge( user_profile, on='user_id' )
merged_data.head(4)

                                    user_id  ...   registered
0  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  Feb 1, 2007
1  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  Feb 1, 2007
2  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  Feb 1, 2007
3  00000c289a1829a808ac09c00daf10bc3c4e223b  ...  Feb 1, 2007

[4 rows x 8 columns]

In [162]:
merged_data.shape

(17535569, 8)

In [163]:
plays_data.shape

(17535655, 4)

In [164]:
user_profile.shape

(359347, 5)

# Gender behaviour

In [165]:
merged_data.columns

Index(['user_id', 'artist_id', 'artist_name', 'plays', 'gender', 'age',
       'country', 'registered'],
      dtype='object')

In [166]:
gender_data = merged_data[ ['gender', 'artist_id', 'plays'] ]
gender_data.head(2)

  gender                             artist_id  plays
0      f  3bd73256-3905-4f3a-97e2-8b341527f805   2137
1      f  f2fb0ff0-5679-42ec-a55c-15109ce6e320   1099

In [167]:
gender_aggr = gender_data.groupby( ['gender', 'artist_id'], as_index=False ).sum()
gender_aggr.head(2)

  gender                             artist_id  plays
0      f  00010eb3-ebfe-4965-81ef-0ac64cd49fde     30
1      f  0001cd84-2a11-4699-8d6b-0abf969c5f06    551

# Famous artists that Male mostly listen to

In [168]:
gender_aggr[ gender_aggr.gender == 'm' ].sort_values( 'plays', ascending=False ).head()

       gender                             artist_id     plays
199147      m  b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d  20465864
193468      m  a74b1b7f-71a5-4011-9441-d0b5e4122711  19101652
156088      m  65f4f0c5-ef9e-490c-aee3-909e7ae6b2ab  13073361
173275      m  83d91898-7763-47d7-b03b-b92132375c47  12868359
214725      m  cc197bad-dc9c-440d-a5b5-d52ba2e14234  11173069

# Famous artists that Female mostly listen to

In [169]:
gender_aggr[ gender_aggr.gender == 'f' ].sort_values( 'plays', ascending=False ).head()

      gender                             artist_id    plays
67491      f  b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d  7390594
63792      f  a74b1b7f-71a5-4011-9441-d0b5e4122711  5817493
77870      f  cc197bad-dc9c-440d-a5b5-d52ba2e14234  4418967
59667      f  9c9f1380-2516-4fc9-a3e6-f9f61941d090  4276872
50590      f  847e8284-8582-4b0e-9c26-b042a4f49e57  3678030

# Total songs played by Male vs Female

In [170]:
gender_aggr[ gender_aggr.gender == 'f' ].groupby('gender').sum()

            plays
gender
f       786781445

In [171]:
gender_aggr[ gender_aggr.gender == 'm' ].groupby('gender').sum()

             plays
gender
m       2652333874

In [172]:
gender_aggr.groupby('gender').sum()

             plays
gender
f        786781445
m       2652333874

In [173]:
del gender_aggr
del plays_data

# Age Groups Detailed Analysis

In [174]:
age_data = merged_data[ ['user_id', 'age', 'artist_id', 'plays'] ]
age_data.head(2)

                                    user_id  ...  plays
0  00000c289a1829a808ac09c00daf10bc3c4e223b  ...   2137
1  00000c289a1829a808ac09c00daf10bc3c4e223b  ...   1099

[2 rows x 4 columns]

In [175]:
del merged_data
del user_profile

In [176]:
age_data.age.describe()

count   13896298.000
mean          25.189
std           21.954
min        -1337.000
25%           20.000
50%           23.000
75%           28.000
max         1002.000
Name: age, dtype: float64

In [177]:
age_data.age.value_counts()

20.000      1166404
21.000      1165846
22.000      1079985
19.000      1072002
23.000       970956
             ...
84.000          235
85.000          223
121.000          89
1002.000         50
666.000          48
Name: age, Length: 113, dtype: int64

In [178]:
age_data.age.isnull().sum()

3639271

In [179]:
age_data.isnull().sum()

user_id            0
age          3639271
artist_id     226136
plays              0
dtype: int64

In [180]:
age_data[ (age_data.age < 110) & (age_data.age > 0) ].sort_values('age', ascending=False)

                                           user_id  ...  plays
16167946  ec273d011eafc1e3956efd8387b1a284bc98293f  ...      6
1149608   10c2e1645153543f756dcca18b06f8e5aee02dc1  ...    586
1149601   10c2e1645153543f756dcca18b06f8e5aee02dc1  ...   1250
1149602   10c2e1645153543f756dcca18b06f8e5aee02dc1  ...   1187
1149603   10c2e1645153543f756dcca18b06f8e5aee02dc1  ...   1171
...                                            ...  ...    ...
8661409   7e968314a7347a56f6cf7506200f4a09efd956d6  ...    475
8661408   7e968314a7347a56f6cf7506200f4a09efd956d6  ...    482
17079533  f94542e9fd98a96d97ee8c579dad25ca64205985  ...     26
17079532  f94542e9fd98a96d97ee8c579dad25ca64205985  ...     27
8380789   7a819a22c7c7eed19d11754798a80e87ed058761  ...    676

[13893237 rows x 4 columns]

In [181]:
# age_data = age_data[ np.isfinite(age_data.age) ]
# age_data.isnull().sum()

In [182]:
age_data.dropna(axis=0, subset=['age'], inplace=True)

In [183]:
age_data.isnull().sum()

user_id           0
age               0
artist_id    178067
plays             0
dtype: int64

In [184]:
def age_grouping(age):
  if age>0 and age<18:
    return 'g1'
  elif age>=18 and age<23:
    return 'g2'
  elif age>=23 and age<28:
    return 'g3'
  elif age>=28 and age<35:
    return 'g4'
  elif age>=35 and age<110:
    return 'g5'

In [185]:
age_data['group'] = age_data.age.apply( lambda x: age_grouping(x) )
age_data.head(2)

                                    user_id    age  ... plays  group
0  00000c289a1829a808ac09c00daf10bc3c4e223b 22.000  ...  2137     g2
1  00000c289a1829a808ac09c00daf10bc3c4e223b 22.000  ...  1099     g2

[2 rows x 5 columns]

In [186]:
age_data.describe()

               age        plays
count 13896298.000 13896298.000
mean        25.189      227.840
std         21.954      633.320
min      -1337.000        1.000
25%         20.000       38.000
50%         23.000      102.000
75%         28.000      238.000
max       1002.000   419157.000

# Number of user in each age group

In [187]:
age_data[ ['user_id', 'group'] ].groupby('group').nunique()

       user_id
group
g1       21458
g2      109386
g3       77239
g4       45660
g5       30265

In [188]:
age_data.head(2)

                                    user_id    age  ... plays  group
0  00000c289a1829a808ac09c00daf10bc3c4e223b 22.000  ...  2137     g2
1  00000c289a1829a808ac09c00daf10bc3c4e223b 22.000  ...  1099     g2

[2 rows x 5 columns]

In [189]:
age_aggr = age_data[ ['group', 'artist_id', 'plays'] ].groupby( ['group', 'artist_id'], as_index=False ).sum()
age_aggr.head(2)

  group                             artist_id  plays
0    g1  0001cd84-2a11-4699-8d6b-0abf969c5f06    695
1    g1  0002f649-8285-4a72-b847-b3854e1a449c   2991

# Artist choice for different age group

In [193]:
age_aggr[ age_aggr.group == 'g2' ].sort_values('plays', ascending=False)

       group                             artist_id     plays
126732    g2  b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d  11007044
122832    g2  a74b1b7f-71a5-4011-9441-d0b5e4122711   9104060
118523    g2  9c9f1380-2516-4fc9-a3e6-f9f61941d090   6998555
137636    g2  cc197bad-dc9c-440d-a5b5-d52ba2e14234   6707053
154259    g2  f59c5520-5f46-4d2c-b2c4-822eabf53419   6700049
...      ...                                   ...       ...
136434    g2  c91d8133-dd0c-4c26-8b89-c2ed991f3966         1
114644    g2  92ba8b63-936f-4c40-a848-75015ed675e0         1
68993     g2  2196067d-73db-4ab0-972d-34aba617a47f         1
59415     g2  09bcde35-8f0c-4e08-b4a3-e184508dfe2b         1
147031    g2  e3ac90f4-72ae-4486-ada9-6051f4aba99a         1

[102848 rows x 3 columns]

In [194]:
del age_data
del age_aggr

# Country detailed Analysis

In [195]:
data_file = os.path.join( DATA_DIR, 'usersha1-profile.tsv' )
user_profile = pd.read_csv( data_file, sep='\t', header=None)

In [196]:
user_profile.head(2)

                                          0  1      2        3            4
0  00000c289a1829a808ac09c00daf10bc3c4e223b  f 22.000  Germany  Feb 1, 2007
1  00001411dc427966b17297bf4d69e7e193135d89  f    nan   Canada  Dec 4, 2007

In [197]:
user_profile.columns = ['user_id', 'gender', 'age', 'country', 'registered']

In [198]:
user_profile = user_profile[ ['user_id', 'country'] ]
user_profile.head()

                                    user_id        country
0  00000c289a1829a808ac09c00daf10bc3c4e223b        Germany
1  00001411dc427966b17297bf4d69e7e193135d89         Canada
2  00004d2ac9316e22dc007ab2243d6fcb239e707d        Germany
3  000063d3fe1cf2ba248b9e3c3f0334845a27a6bf         Mexico
4  00007a47085b9aab8af55f52ec8846ac479ac4fe  United States

In [201]:
# Number of users per country
user_profile['country'].value_counts()

United States         67044
Germany               31651
United Kingdom        29902
Poland                20987
Russian Federation    19833
                      ...
Marshall Islands          4
Benin                     3
Liberia                   3
Palau                     3
Gambia                    3
Name: country, Length: 239, dtype: int64